Revit 2027 API
FluidTemperatureSetIterator.GetCurrent Method
 Returns the current FluidTemperature.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FluidTemperature GetCurrent()
Public Function GetCurrent As FluidTemperature
public:
FluidTemperature^ GetCurrent()
member GetCurrent : unit -> FluidTemperature
Return Value
FluidTemperature
 The current FluidTemperature.
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
See Also
Reference
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace